loadtest/results/02-default-config.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: 02-default-config-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m5s max duration (incl. graceful stop):
              * default_config_ramp: Up to 20 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 5s)


running (0m01.0s), 00/20 VUs, 0 complete and 0 interrupted iterations
default_config_ramp   [   2% ] 00/20 VUs  0m01.0s/1m00.0s

running (0m02.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
default_config_ramp   [   3% ] 01/20 VUs  0m02.0s/1m00.0s

running (0m03.0s), 01/20 VUs, 1 complete and 0 interrupted iterations
default_config_ramp   [   5% ] 01/20 VUs  0m03.0s/1m00.0s

running (0m04.0s), 02/20 VUs, 3 complete and 0 interrupted iterations
default_config_ramp   [   7% ] 02/20 VUs  0m04.0s/1m00.0s

running (0m05.0s), 03/20 VUs, 5 complete and 0 interrupted iterations
default_config_ramp   [   8% ] 03/20 VUs  0m05.0s/1m00.0s

running (0m06.0s), 03/20 VUs, 9 complete and 0 interrupted iterations
default_config_ramp   [  10% ] 03/20 VUs  0m06.0s/1m00.0s

running (0m07.0s), 04/20 VUs, 13 complete and 0 interrupted iterations
default_config_ramp   [  12% ] 04/20 VUs  0m07.0s/1m00.0s

running (0m08.0s), 05/20 VUs, 17 complete and 0 interrupted iterations
default_config_ramp   [  13% ] 05/20 VUs  0m08.0s/1m00.0s

running (0m09.0s), 05/20 VUs, 23 complete and 0 interrupted iterations
default_config_ramp   [  15% ] 05/20 VUs  0m09.0s/1m00.0s

running (0m10.0s), 06/20 VUs, 30 complete and 0 interrupted iterations
default_config_ramp   [  17% ] 06/20 VUs  0m10.0s/1m00.0s

running (0m11.0s), 07/20 VUs, 38 complete and 0 interrupted iterations
default_config_ramp   [  18% ] 07/20 VUs  0m11.0s/1m00.0s

running (0m12.0s), 07/20 VUs, 46 complete and 0 interrupted iterations
default_config_ramp   [  20% ] 07/20 VUs  0m12.0s/1m00.0s

running (0m13.0s), 08/20 VUs, 56 complete and 0 interrupted iterations
default_config_ramp   [  22% ] 08/20 VUs  0m13.0s/1m00.0s

running (0m14.0s), 09/20 VUs, 66 complete and 0 interrupted iterations
default_config_ramp   [  23% ] 09/20 VUs  0m14.0s/1m00.0s

running (0m15.0s), 09/20 VUs, 76 complete and 0 interrupted iterations
default_config_ramp   [  25% ] 09/20 VUs  0m15.0s/1m00.0s

running (0m16.0s), 10/20 VUs, 89 complete and 0 interrupted iterations
default_config_ramp   [  27% ] 10/20 VUs  0m16.0s/1m00.0s

running (0m17.0s), 10/20 VUs, 102 complete and 0 interrupted iterations
default_config_ramp   [  28% ] 10/20 VUs  0m17.0s/1m00.0s

running (0m18.0s), 10/20 VUs, 114 complete and 0 interrupted iterations
default_config_ramp   [  30% ] 10/20 VUs  0m18.0s/1m00.0s

running (0m19.0s), 11/20 VUs, 126 complete and 0 interrupted iterations
default_config_ramp   [  32% ] 11/20 VUs  0m19.0s/1m00.0s

running (0m20.0s), 11/20 VUs, 141 complete and 0 interrupted iterations
default_config_ramp   [  33% ] 11/20 VUs  0m20.0s/1m00.0s

running (0m21.0s), 11/20 VUs, 155 complete and 0 interrupted iterations
default_config_ramp   [  35% ] 11/20 VUs  0m21.0s/1m00.0s

running (0m22.0s), 12/20 VUs, 169 complete and 0 interrupted iterations
default_config_ramp   [  37% ] 12/20 VUs  0m22.0s/1m00.0s

running (0m23.0s), 12/20 VUs, 183 complete and 0 interrupted iterations
default_config_ramp   [  38% ] 12/20 VUs  0m23.0s/1m00.0s

running (0m24.0s), 12/20 VUs, 199 complete and 0 interrupted iterations
default_config_ramp   [  40% ] 12/20 VUs  0m24.0s/1m00.0s

running (0m25.0s), 13/20 VUs, 214 complete and 0 interrupted iterations
default_config_ramp   [  42% ] 13/20 VUs  0m25.0s/1m00.0s

running (0m26.0s), 13/20 VUs, 230 complete and 0 interrupted iterations
default_config_ramp   [  43% ] 13/20 VUs  0m26.0s/1m00.0s

running (0m27.0s), 13/20 VUs, 246 complete and 0 interrupted iterations
default_config_ramp   [  45% ] 13/20 VUs  0m27.0s/1m00.0s

running (0m28.0s), 14/20 VUs, 263 complete and 0 interrupted iterations
default_config_ramp   [  47% ] 14/20 VUs  0m28.0s/1m00.0s

running (0m29.0s), 14/20 VUs, 280 complete and 0 interrupted iterations
default_config_ramp   [  48% ] 14/20 VUs  0m29.0s/1m00.0s

running (0m30.0s), 14/20 VUs, 298 complete and 0 interrupted iterations
default_config_ramp   [  50% ] 14/20 VUs  0m30.0s/1m00.0s

running (0m31.0s), 15/20 VUs, 316 complete and 0 interrupted iterations
default_config_ramp   [  52% ] 15/20 VUs  0m31.0s/1m00.0s

running (0m32.0s), 15/20 VUs, 335 complete and 0 interrupted iterations
default_config_ramp   [  53% ] 15/20 VUs  0m32.0s/1m00.0s

running (0m33.0s), 15/20 VUs, 353 complete and 0 interrupted iterations
default_config_ramp   [  55% ] 15/20 VUs  0m33.0s/1m00.0s

running (0m34.0s), 16/20 VUs, 372 complete and 0 interrupted iterations
default_config_ramp   [  57% ] 16/20 VUs  0m34.0s/1m00.0s

running (0m35.0s), 16/20 VUs, 392 complete and 0 interrupted iterations
default_config_ramp   [  58% ] 16/20 VUs  0m35.0s/1m00.0s

running (0m36.0s), 16/20 VUs, 413 complete and 0 interrupted iterations
default_config_ramp   [  60% ] 16/20 VUs  0m36.0s/1m00.0s

running (0m37.0s), 17/20 VUs, 432 complete and 0 interrupted iterations
default_config_ramp   [  62% ] 17/20 VUs  0m37.0s/1m00.0s

running (0m38.0s), 17/20 VUs, 454 complete and 0 interrupted iterations
default_config_ramp   [  63% ] 17/20 VUs  0m38.0s/1m00.0s

running (0m39.0s), 17/20 VUs, 474 complete and 0 interrupted iterations
default_config_ramp   [  65% ] 17/20 VUs  0m39.0s/1m00.0s

running (0m40.0s), 18/20 VUs, 495 complete and 0 interrupted iterations
default_config_ramp   [  67% ] 18/20 VUs  0m40.0s/1m00.0s

running (0m41.0s), 18/20 VUs, 519 complete and 0 interrupted iterations
default_config_ramp   [  68% ] 18/20 VUs  0m41.0s/1m00.0s

running (0m42.0s), 18/20 VUs, 542 complete and 0 interrupted iterations
default_config_ramp   [  70% ] 18/20 VUs  0m42.0s/1m00.0s

running (0m43.0s), 19/20 VUs, 564 complete and 0 interrupted iterations
default_config_ramp   [  72% ] 19/20 VUs  0m43.0s/1m00.0s

running (0m44.0s), 19/20 VUs, 587 complete and 0 interrupted iterations
default_config_ramp   [  73% ] 19/20 VUs  0m44.0s/1m00.0s

running (0m45.0s), 19/20 VUs, 612 complete and 0 interrupted iterations
default_config_ramp   [  75% ] 19/20 VUs  0m45.0s/1m00.0s

running (0m46.0s), 19/20 VUs, 636 complete and 0 interrupted iterations
default_config_ramp   [  77% ] 19/20 VUs  0m46.0s/1m00.0s

running (0m47.0s), 18/20 VUs, 660 complete and 0 interrupted iterations
default_config_ramp   [  78% ] 18/20 VUs  0m47.0s/1m00.0s

running (0m48.0s), 17/20 VUs, 682 complete and 0 interrupted iterations
default_config_ramp   [  80% ] 17/20 VUs  0m48.0s/1m00.0s

running (0m49.0s), 16/20 VUs, 703 complete and 0 interrupted iterations
default_config_ramp   [  82% ] 16/20 VUs  0m49.0s/1m00.0s

running (0m50.0s), 15/20 VUs, 722 complete and 0 interrupted iterations
default_config_ramp   [  83% ] 15/20 VUs  0m50.0s/1m00.0s

running (0m51.0s), 13/20 VUs, 740 complete and 0 interrupted iterations
default_config_ramp   [  85% ] 13/20 VUs  0m51.0s/1m00.0s

running (0m52.0s), 12/20 VUs, 756 complete and 0 interrupted iterations
default_config_ramp   [  87% ] 12/20 VUs  0m52.0s/1m00.0s

running (0m53.0s), 10/20 VUs, 771 complete and 0 interrupted iterations
default_config_ramp   [  88% ] 10/20 VUs  0m53.0s/1m00.0s

running (0m54.0s), 09/20 VUs, 783 complete and 0 interrupted iterations
default_config_ramp   [  90% ] 09/20 VUs  0m54.0s/1m00.0s

running (0m55.0s), 08/20 VUs, 795 complete and 0 interrupted iterations
default_config_ramp   [  92% ] 08/20 VUs  0m55.0s/1m00.0s

running (0m56.0s), 06/20 VUs, 805 complete and 0 interrupted iterations
default_config_ramp   [  93% ] 06/20 VUs  0m56.0s/1m00.0s

running (0m57.0s), 05/20 VUs, 813 complete and 0 interrupted iterations
default_config_ramp   [  95% ] 05/20 VUs  0m57.0s/1m00.0s

running (0m58.0s), 03/20 VUs, 818 complete and 0 interrupted iterations
default_config_ramp   [  97% ] 03/20 VUs  0m58.0s/1m00.0s

running (0m59.0s), 02/20 VUs, 822 complete and 0 interrupted iterations
default_config_ramp   [  98% ] 02/20 VUs  0m59.0s/1m00.0s

running (1m00.0s), 01/20 VUs, 825 complete and 0 interrupted iterations
default_config_ramp   [ 100% ] 01/20 VUs  1m00.0s/1m00.0s

     ✓ discovery status is 200 or 429, never 5xx
     ✓ map status is 200 or 429, never 5xx

     checks.........................: 100.00% 1652 out of 1652
     data_received..................: 2.2 MB  36 kB/s
     data_sent......................: 413 kB  6.9 kB/s
     discovery_200..................: 20      0.332225/s
     discovery_200_duration_ms......: avg=41.135823 min=36.219556 med=39.285288 max=67.941332 p(90)=45.910703 p(95)=48.524709
     discovery_429..................: 806     13.388658/s
   ✓ discovery_5xx_or_other.........: 0       0/s
     http_req_blocked...............: avg=14.38µs   min=2.77µs    med=7.62µs    max=1.14ms    p(90)=11.42µs   p(95)=14µs     
     http_req_connecting............: avg=2.97µs    min=0s        med=0s        max=682.35µs  p(90)=0s        p(95)=0s       
     http_req_duration..............: avg=3.21ms    min=975.92µs  med=2.13ms    max=67.94ms   p(90)=3.1ms     p(95)=4.04ms   
       { expected_response:true }...: avg=41.29ms   min=35.86ms   med=39.45ms   max=67.94ms   p(90)=46.91ms   p(95)=54.25ms  
     http_req_failed................: 97.57%  1612 out of 1652
     http_req_receiving.............: avg=96.66µs   min=25.44µs   med=81.53µs   max=1.46ms    p(90)=156.75µs  p(95)=186.94µs 
     http_req_sending...............: avg=34.54µs   min=6.21µs    med=30.27µs   max=303.49µs  p(90)=53.99µs   p(95)=66.37µs  
     http_req_tls_handshaking.......: avg=0s        min=0s        med=0s        max=0s        p(90)=0s        p(95)=0s       
     http_req_waiting...............: avg=3.08ms    min=868.48µs  med=1.98ms    max=67.61ms   p(90)=2.99ms    p(95)=3.92ms   
     http_reqs......................: 1652    27.441766/s
     iteration_duration.............: avg=808.28ms  min=803.27ms  med=806.18ms  max=910.23ms  p(90)=807.99ms  p(95)=809.38ms 
     iterations.....................: 826     13.720883/s
     map_200........................: 20      0.332225/s
     map_200_duration_ms............: avg=41.462896 min=35.863144 med=39.456295 max=67.051433 p(90)=47.523454 p(95)=54.256164
     map_429........................: 806     13.388658/s
   ✓ map_5xx_or_other...............: 0       0/s
     vus............................: 1       min=0            max=19
     vus_max........................: 20      min=20           max=20


running (1m00.2s), 00/20 VUs, 826 complete and 0 interrupted iterations
default_config_ramp ✓ [ 100% ] 00/20 VUs  1m0s